In [76]:
# import pandas from library

import pandas as pd

In [77]:
pd.read_csv('preprocessed_data.csv').shape

(3592, 160)

In [78]:
other_path = 'raw_fighter_details.csv'
df = pd.read_csv(other_path, header=0)

In [79]:





df.head(5)
#df.tail(5)

  fighter_name  Height    Weight Reach Stance  DOB
0   AJ Fonseca   5' 4"  145 lbs.   NaN    NaN  NaN
1  AJ Matthews  5' 11"  185 lbs.   NaN    NaN  NaN
2     AJ McKee  5' 10"  145 lbs.   NaN    NaN  NaN
3    AJ Siscoe   5' 7"  135 lbs.   NaN    NaN  NaN
4   Aalon Cruz   6' 0"  145 lbs.   NaN    NaN  NaN

In [80]:
len(df.columns)

6

In [81]:
df.shape

(3313, 6)

In [82]:
df.loc[4:4]

  fighter_name Height    Weight Reach Stance  DOB
4   Aalon Cruz  6' 0"  145 lbs.   NaN    NaN  NaN

In [84]:
missing_data = df.isnull()
missing_data.head(6)

   fighter_name  Height  Weight  Reach  Stance    DOB
0         False   False   False   True    True   True
1         False   False   False   True    True   True
2         False   False   False   True    True   True
3         False   False   False   True    True   True
4         False   False   False   True    True   True
5         False   False   False   True   False  False

In [85]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

fighter_name
False    3313
Name: fighter_name, dtype: int64

Height
False    3050
True      263
Name: Height, dtype: int64

Weight
False    3238
True       75
Name: Weight, dtype: int64

Reach
True     1744
False    1569
Name: Reach, dtype: int64

Stance
False    2439
True      874
Name: Stance, dtype: int64

DOB
False    2573
True      740
Name: DOB, dtype: int64

In [11]:
df.corr()

Empty DataFrame
Columns: []
Index: []

In [12]:
df.corr()

Empty DataFrame
Columns: []
Index: []